jshsakura/game-and-watch-retro-go-sd/external/nh-doom/NRF52840Doom/Doom/source/w_wad.c
/**
 *  Doom Port to the nRF52840 by Nicola Wrachien (next-hack in the comments)
 *
 *  This port is based on the excellent doomhack's GBA Doom Port,
 *  with Kippykip additions.
 *  
 *  Several data structures and functions have been optimized 
 *  to fit in only 256kB RAM of nRF52840 (GBA has 384 kB RAM). 
 *  Z-Depth Light has been restored with almost no RAM consumption!
 *  Tons of speed optimizations have been done, and the game now
 *  runs extremely fast, despite the much higher 3D resolution with
 *  respect to GBA.
 *
 *  PrBoom: a Doom port merged with LxDoom and LSDLDoom
 *  based on BOOM, a modified and improved DOOM engine
 *  Copyright (C) 1999 by
 *  id Software, Chi Hoang, Lee Killough, Jim Flynn, Rand Phares, Ty Halderman
 *  Copyright (C) 1999-2000 by
 *  Jess Haas, Nicolas Kalkhof, Colin Phipps, Florian Schulze
 *  Copyright 2005, 2006 by
 *  Florian Schulze, Colin Phipps, Neil Stevens, Andrey Budko
 *  Copyright (C) 2021 Nicola Wrachien (next-hack in the comments)
 *  on nRF52840 port.
 *
 *  This program is free software; you can redistribute it and/or
 *  modify it under the terms of the GNU General Public License
 *  as published by the Free Software Foundation; either version 2
 *  of the License, or (at your option) any later version.
 *
 *  This program is distributed in the hope that it will be useful,
 *  but WITHOUT ANY WARRANTY; without even the implied warranty of
 *  MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the
 *  GNU General Public License for more details.
 *
 *  You should have received a copy of the GNU General Public License
 *  along with this program; if not, write to the Free Software
 *  Foundation, Inc., 59 Temple Place - Suite 330, Boston, MA
 *  02111-1307, USA.
 *
 * DESCRIPTION:
 *      Handles WAD file header, directory, lump I/O.
 *
 * next-hack:
 * Added code to load data from external flash.
 * Added code to store/cache some wad data (And more) to internal flash.
 * This latter might be moved sooner or later to a better place.
 *-----------------------------------------------------------------------------
 */

// use config.h if autoconf made one -- josh
#ifdef HAVE_CONFIG_H
#include "config.h"
#endif
#ifdef HAVE_UNISTD_H
#include <unistd.h>
#endif

#include "doomstat.h"
#include "d_net.h"
#include "doomtype.h"
#include "i_system.h"

#include "doom_iwad.h"

#include "w_wad.h"
#include "lprintf.h"

#include "global_data.h"
#include <stdint.h>
#include "i_spi_support.h"
#include "nrf.h"
#include "main.h"
#define FLASH_ALIGNMENT 4
/* Flash organization
 * After 256k, 8k Aligned
 * (4-byte word alignment)
 * Wad CRC      -  used to determine, together with length, if the Wad has been changed.
 * Wad Length   -
 * Wad immutableData CRC  - To determine if the cache is ok, to speed up boot time.
 * wad immutableDataLength
 * Wad Number Of Lumps
 * Address to Lump Offset Table
 * Address to Lump Lengths Table
 * Number of Sprite
 * Address to Sprite Def table
 * Address to level table
 *
 * Lump Offset Table
 * Lump Offset Length
 *
 *
 *
 * Level Table Address: (origin 8kB alignd)
 * Cached addresses
 *
 */
#define getNumberOfLumps() (_g->numlumps)
uint32_t currentImmutableFlashOffset = 0;
uint32_t currentLevelFlashOffset = 0;
wad_immutable_flash_data_t *p_wad_immutable_flash_data;
wad_level_flash_data_t *p_wad_level_flash_data;
void **lumpPtrArray;
boolean lumpPtrArrayStoredInFlash = false;
void setCurrentImmutableFlashOffset(uint32_t offset)
{
    currentImmutableFlashOffset = offset;
}

void** storeLumpArrayToFlash(boolean levelChanged)
{
    lumpPtrArrayStoredInFlash = true;
    void **oldLumpPtrArrayAddress = lumpPtrArray;
    if (levelChanged)
    {
        lumpPtrArray = writeBufferToFlashRegion(lumpPtrArray, getNumberOfLumps() * sizeof(void*), FLASH_LEVEL_REGION, true);
        printf("changed, updated lumpAddressTable 0x%x\r\n", lumpPtrArray);
    }
    else
    {  // do not reload
        lumpPtrArray = p_wad_immutable_flash_data->levelData->lumpAddressTable;
        printf("level not changed, retrieving old lumpAddressTable 0x%x\r\n", lumpPtrArray);
    }
    Z_Free(oldLumpPtrArrayAddress);
    return lumpPtrArray;
}
#if CACHE_ALL_COLORMAP_TO_RAM
uint8_t ramColorMap[256 * 34]; // this gives only marginal gain: about 500 us per frame on average.
#endif
void initImmutableFlashRegion()
{
    // use a temporary region in RAM
    p_wad_immutable_flash_data = Z_Malloc(sizeof(*p_wad_immutable_flash_data), PU_STATIC, NULL);
    spiFlashSetAddress(EXT_FLASH_BASE);         // just to init SPI address
    // create temporary lumpptr
    lumpPtrArrayStoredInFlash = false;
    lumpPtrArray = NULL; // this will force all cache functions to look everytime from the external flash
    // get wad size
    currentImmutableFlashOffset = 0;
    spiFlashSetAddress((uint32_t) p_doom_iwad_len);
    spiFlashGetData(&p_wad_immutable_flash_data->wadSize, 4);
    spiFlashSetAddress((uint32_t) doom_iwad);
    // get wad header (includes also number of lumps and lump table offset)
    spiFlashGetData(&p_wad_immutable_flash_data->wadHeader, sizeof(p_wad_immutable_flash_data->wadHeader));
    // set size of this structure
    p_wad_immutable_flash_data->immutableDataLength = sizeof(wad_immutable_flash_data_t);
    currentImmutableFlashOffset = sizeof(wad_immutable_flash_data_t);
    /* [diag] dump the WAD anchors so a fault in the first lump read can be
     * traced to the exact bad address (one decisive line, removable). */
    printf("[diag] iwad=0x%08lX lenptr=0x%08lX wadSize=%lu nlumps=%d infoofs=%ld WADADDR=0x%08lX FCADDR=0x%08lX\n",
           (unsigned long)(uintptr_t)doom_iwad, (unsigned long)(uintptr_t)p_doom_iwad_len,
           (unsigned long)p_wad_immutable_flash_data->wadSize,
           (int)p_wad_immutable_flash_data->wadHeader.numlumps,
           (long)p_wad_immutable_flash_data->wadHeader.infotableofs,
           (unsigned long)(uintptr_t)WAD_ADDRESS, (unsigned long)(uintptr_t)FLASH_ADDRESS);
    int diag_playpal = W_GetNumForName("PLAYPAL");
    int diag_colormap = W_GetNumForName("COLORMAP");
    printf("[diag] PLAYPAL=%d COLORMAP=%d (numlumps=%d) -> reading lumps now\n",
           diag_playpal, diag_colormap, (int)getNumberOfLumps());
    // get the palette
    p_wad_immutable_flash_data->palette_lump = writeLumpToFlashRegion(diag_playpal, FLASH_IMMUTABLE_REGION, true);
    // get the colormap
    p_wad_immutable_flash_data->colormaps = writeLumpToFlashRegion(diag_colormap, FLASH_IMMUTABLE_REGION, true);
    //
    #if CACHE_ALL_COLORMAP_TO_RAM
        memcpy (ramColorMap, p_wad_immutable_flash_data->colormaps, sizeof (ramColorMap));
        p_wad_immutable_flash_data->colormaps = ramColorMap;
    #endif
}
wad_level_flash_data_t* initLevelFlashRegion()
{
    p_wad_level_flash_data = Z_Malloc(sizeof(*p_wad_level_flash_data), PU_STATIC, NULL);
    memset(p_wad_level_flash_data, 0, sizeof(*p_wad_level_flash_data));
    currentLevelFlashOffset = sizeof(*p_wad_level_flash_data);
    return p_wad_level_flash_data;
}
void initLumpPtrTable(void)
{
    printf("Init ram lump table\r\n");
    lumpPtrArray = Z_Malloc(getNumberOfLumps() * sizeof(void*), PU_STATIC, NULL);
    // init to 0xFF
    memset(lumpPtrArray, 0xFF, getNumberOfLumps() * sizeof(void*));
    //
    lumpPtrArrayStoredInFlash = false;
    // update - just for sake of completeness, but we actually won't use it - colormaps and playpal lumps
    lumpPtrArray[W_GetNumForName("COLORMAP")] = p_wad_immutable_flash_data->colormaps;
    lumpPtrArray[W_GetNumForName("PLAYPAL")] = p_wad_immutable_flash_data->palette_lump;
    //
}
void getFileLumpByNum(int n, filelump_t *fl)
{
    uint32_t src = WAD_ADDRESS + p_wad_immutable_flash_data->wadHeader.infotableofs + n * sizeof(filelump_t);
    /* [diag] log the first few directory-entry source addresses; the LAST one
     * in /doom_trace.txt before a fault is the bad pointer. Removable. */
    static int diag_calls = 0;
    if (diag_calls < 6) { printf("[diag] getFileLump n=%d src=0x%08lX\n", n, (unsigned long)src); diag_calls++; }
    spiFlashSetAddress(src);
    spiFlashGetData(fl, sizeof(filelump_t));
}
// get how much space we have in flash, taking into account if we already stored the lump pointer table or not.
int getUserFlashRegionRemainingSpace()
{
    int size = FLASH_CACHE_REGION_SIZE - (currentLevelFlashOffset + ((currentImmutableFlashOffset + FLASH_BLOCK_SIZE - 1) & ~(FLASH_BLOCK_SIZE - 1)));
    // we need to take into account that we will need to store also the lumpPtrArray.
    if (lumpPtrArrayStoredInFlash == 0)
        size -= getNumberOfLumps() * sizeof(void*);
    if (size < 0)
        return 0;
    return size;
}

void flashErasePage(uint32_t *pageAddress)
{
    nh_disable_irq();
    // enable write
    // Write enable
    NRF_NVMC->CONFIG = NVMC_CONFIG_WEN_Een << NVMC_CONFIG_WEN_Pos;
    while (NRF_NVMC->READY == NVMC_READY_READY_Busy){}
    NRF_NVMC->ERASEPAGE = (uint32_t) pageAddress;
    while (NRF_NVMC->READY == NVMC_READY_READY_Busy){}
    NRF_NVMC->CONFIG = NVMC_CONFIG_WEN_Ren << NVMC_CONFIG_WEN_Pos;
    while (NRF_NVMC->READY == NVMC_READY_READY_Busy){}

    nh_enable_irq();
}
#ifdef NHDOOM_COUNT_WRITES
/* host-only: counts every actual flash word write. With a correctly pre-baked +
 * relocated cache pre-loaded, the engine recomputes but writes NOTHING, so this
 * must be 0 (proves the bake is complete). Compiled out on device. */
unsigned long nh_flash_write_count = 0;
#endif
void programFlashWord(uint32_t *address, uint32_t word)
{
    if (*address == 0xFFFFFFFF)
    {
#ifdef NHDOOM_COUNT_WRITES
        nh_flash_write_count++;
#endif
        nh_disable_irq();
        // enable write
        NRF_NVMC->CONFIG = NVMC_CONFIG_WEN_Wen << NVMC_CONFIG_WEN_Pos;
        while (NRF_NVMC->READY == NVMC_READY_READY_Busy){}
        // set address
        *address = word;
        __DMB();
        while (NRF_NVMC->READY == NVMC_READY_READY_Busy){}
        NRF_NVMC->CONFIG = NVMC_CONFIG_WEN_Ren << NVMC_CONFIG_WEN_Pos;
        while (NRF_NVMC->READY == NVMC_READY_READY_Busy){}
        nh_enable_irq();
    }
}
void storeWordToFlash(uint32_t *dest, uint32_t word, uint8_t flashRegion, boolean isHeader)
{
    // first check if dest is compatible, i.e. is the same as sourceo r it is erased
    if (!(*dest == word || *dest == 0xFFFFFFFF))
    {
        // we need to erase before writing. However we need to find the limits...
        uint32_t pageAddress = ((uint32_t) dest) & ~(FLASH_BLOCK_SIZE - 1); // page that will be erased
        uint32_t startCopyAddress = pageAddress;
        uint32_t stopCopyAddress = (uint32_t) dest; // copy up to the previous word.
        // if we are writing in the same page as header, and it is not a header, then we need to skip the first bytes that will be used by the header
        if (pageAddress == FLASH_IMMUTABLE_REGION_ADDRESS && !isHeader)
        {
            startCopyAddress = pageAddress + sizeof(wad_immutable_flash_data_t);
        }
        else if (flashRegion == FLASH_LEVEL_REGION && pageAddress == (uint32_t) p_wad_immutable_flash_data->levelData && !isHeader)
        {
            startCopyAddress = pageAddress + sizeof(wad_level_flash_data_t);
        }
        // now that we know from where to where (stop non inclusive) we need to copy, we can allocate enough buffer
        // note! addresses are 4-byte aligned!
        uint32_t *tmp = Z_Malloc((stopCopyAddress - startCopyAddress), PU_STATIC, NULL);
        for (int i = 0;
                i < (stopCopyAddress - startCopyAddress) / sizeof(uint32_t);
                i++)
        {
            tmp[i] = *((uint32_t*) startCopyAddress + i);
        }
        // erase
        printf("Erasing page 0x%08X Start Copy Addr 0x%08X Stop Copy Addr 0x%08X\r\n. ", pageAddress, startCopyAddress, stopCopyAddress);
        flashErasePage((uint32_t*) pageAddress);
        // write back everything
        for (int i = 0;
                i < (stopCopyAddress - startCopyAddress) / sizeof(uint32_t);
                i++)
        {
            programFlashWord(((uint32_t*) startCopyAddress + i), tmp[i]);
        }
        // free buffer
        Z_Free(tmp);
    }
    // write word
    if (!(*dest == word))
    {
        if (*dest == 0xFFFFFFFF)
            programFlashWord(dest, word);
        else
        {
            printf("trying to overwrite a non blank word: addr: 0x%08X old: 0x%08X new 0x%08X. Is Header: %d flash Region %d Blocking", dest, *dest, word, isHeader, flashRegion);
            while (1);
        }
    }
    //
}
/**
 * @brief write the buffer to the flash region
 */

