jshsakura/game-and-watch-retro-go-sd/external/nh-doom/NRF52840Doom/Doom/source/w_wad.c
void* writeBufferToFlashRegion(void *buffer, int size, uint8_t flashRegion, boolean updateSize)
{
    // todo check and eventually erase
    uint32_t *address;
    size = (size + FLASH_ALIGNMENT - 1) & ~(FLASH_ALIGNMENT - 1);
    if (flashRegion == FLASH_IMMUTABLE_REGION)
    {
        address = (uint32_t*) (FLASH_ADDRESS + currentImmutableFlashOffset);
    }
    else
    {
        address = (uint32_t*) (FLASH_ADDRESS + currentLevelFlashOffset + ((currentImmutableFlashOffset + FLASH_BLOCK_SIZE - 1) & ~(FLASH_BLOCK_SIZE - 1)));
    }
    uint32_t *s = buffer;
    uint32_t *d = address;
    for (int i = 0; i < size / 4; i++)
    {
        storeWordToFlash(d++, *s++, flashRegion, false);
    }
    if (flashRegion == FLASH_IMMUTABLE_REGION)
    {
        currentImmutableFlashOffset += size;
    }
    else
    {
        currentLevelFlashOffset += size;
    }

    if (updateSize)
    {
        if (flashRegion == FLASH_IMMUTABLE_REGION)
        {
            p_wad_immutable_flash_data->immutableDataLength += size;
        }
        else
        {
            p_wad_level_flash_data->dataLength += size;
        }

    }
    return address;
}

void updateLumpAddresses(int lump, void *address)
{
    if (lumpPtrArray)
    {
        if (lumpPtrArrayStoredInFlash)
        {
            printf("Updating lump %d, address 0x%08X\r\n", lump, address);
            if ((uint32_t) lumpPtrArray[lump] != 0xFFFFFFFF)
            {
                if (lumpPtrArray[lump] == address)
                    printf("Same lump address stored\r\n");
                else
                {
                    printf("Different lump address! old: 0x%08X new: 0x%08X. Blocking \r\n", lumpPtrArray[lump], address);
                    while (1);
                }
            }
            else
            {
                printf("Programming\r\n");
                programFlashWord((uint32_t*) &lumpPtrArray[lump], (uint32_t) address);
            }
            printf("Value now in Flash: 0x%08X\r\n", lumpPtrArray[lump]);
        }
        else
            lumpPtrArray[lump] = address;
    }
}
void* writeLumpToFlashRegion(int lumpnum, uint8_t flashRegion, boolean updateSize)
{
    uint32_t *address = 0;
    filelump_t fl;
    getFileLumpByNum(lumpnum, &fl);
    // adjust to boundary
    fl.size = (fl.size + FLASH_ALIGNMENT - 1) & ~(FLASH_ALIGNMENT - 1);

    // will it fit in flash?
    if (fl.size > getUserFlashRegionRemainingSpace() && flashRegion != FLASH_IMMUTABLE_REGION)
    {
        address = (uint32_t*) (WAD_ADDRESS + fl.filepos);
        updateLumpAddresses(lumpnum, address);
        return address;
    }
    spiFlashSetAddress(WAD_ADDRESS + fl.filepos);
    for (int i = 0; i < fl.size / 4; i++)
    {
        uint32_t data;
        spiFlashGetData(&data, 4);
        uint32_t *a = writeBufferToFlashRegion(&data, 4, flashRegion, updateSize);
        if (i == 0)
        {
            address = a;
        }
    }
    updateLumpAddresses(lumpnum, address);
    return address;
}
/*
 * @brief stores to flash the wad_immutable_flash_data_t.
 * This function shall be called after all immutable data has been stored
 * This also updates the position of where level data will start
 * @param
 * @return the address where it has been stored.
 */
void* storeFlashImmutableValues()
{
    // store header
    uint32_t *src = (uint32_t*) p_wad_immutable_flash_data;
    // update pointer to where the level data are going to be stored

    p_wad_immutable_flash_data->levelData = (wad_level_flash_data_t*) ((uint8_t*) FLASH_ADDRESS + ((p_wad_immutable_flash_data->immutableDataLength + FLASH_BLOCK_SIZE - 1) & ~(FLASH_BLOCK_SIZE - 1)));
    for (int i = 0; i < sizeof(*p_wad_immutable_flash_data) / sizeof(uint32_t);
            i++)
    {
        storeWordToFlash((uint32_t*) FLASH_ADDRESS + i, src[i], FLASH_IMMUTABLE_REGION, true);
    }
    // free block
    Z_Free(p_wad_immutable_flash_data);
    p_wad_immutable_flash_data = (void*) FLASH_ADDRESS;
    return (uint32_t*) FLASH_ADDRESS;
}
void* storeLevelValues(boolean levelChanged)
{
    if (levelChanged)
    {
        // store header
        uint32_t *src = (uint32_t*) p_wad_level_flash_data;
        for (int i = 0; i < sizeof(*p_wad_level_flash_data) / sizeof(uint32_t);
                i++)
        {
            storeWordToFlash((uint32_t*) p_wad_immutable_flash_data->levelData + i, src[i], FLASH_LEVEL_REGION, true);
        }
    }
    printf("Freeing p_wad_level_flash_data %0x\r\n", (uint32_t) p_wad_level_flash_data);
    Z_Free(p_wad_level_flash_data);
#ifdef NHDOOM_BAKE_HOOK
    /* host-only: the flash cache is now fully built (immutable + this level), so
     * the host baker/verifier can act here -- BEFORE the (layout-flaky) first
     * frame render -- making bake + write-count verification reliable. */
    { extern void nhdoom_cache_ready(void); nhdoom_cache_ready(); }
#endif
    return (uint32_t*) p_wad_immutable_flash_data->levelData;
}
//
// GLOBALS
//
void ExtractFileBase(const char *path, char *dest)
{
    const char *src = path + strlen(path) - 1;
    int length;

    // back up until a \ or the start
    while (src != path && src[-1] != ':' // killough 3/22/98: allow c:filename
    && *(src - 1) != '\\' && *(src - 1) != '/')
    {
        src--;
    }

    // copy up to eight characters
    memset(dest, 0, 8);
    length = 0;

    while ((*src) && (*src != '.') && (++length < 9))
    {
        *dest++ = toupper(*src);
        src++;  //nh fixed, it was *src++.
    }
    /* cph - length check removed, just truncate at 8 chars.
     * If there are 8 or more chars, we'll copy 8, and no zero termination
     */
}

//
// LUMP BASED ROUTINES.
//

//
// W_AddFile
// All files are optional, but at least one file must be
//  found (PWAD, if all required lumps are present).
// Files with a .wad extension are wadlink files
//  with multiple lumps.
// Other files are single lumps with the base filename
//  for the lump name.
//
// Reload hack removed by Lee Killough
// CPhipps - source is an enum
//
// proff - changed using pointer to wadfile_info_t
static void W_AddFile()
{

    wadinfo_t header;
    spiFlashSetAddress((uint32_t) p_doom_iwad_len);
    uint32_t length;
    spiFlashGetData(&length, sizeof(length));
    spiFlashSetAddress((uint32_t) doom_iwad);
    if (length)
    {
        spiFlashGetData(&header, sizeof(header));
        if (strncmp(header.identification, "IWAD", 4))
            I_Error("W_AddFile: Wad file doesn't have IWAD id");

        _g->numlumps = header.numlumps;
    }
}

