jshsakura/game-and-watch-retro-go-sd/external/nh-doom/NRF52840Doom/Doom/source/w_wad.c
//Return -1 if not found.
//Set lump ptr if found.
int lumpByNameRequest;
static int PUREFUNC FindLumpByName(const char *name, const filelump_t **lump)
{
    lumpByNameRequest++;
    const wadinfo_t *header = (const wadinfo_t*) WAD_ADDRESS;

    spiFlashSetAddress((uint32_t) p_doom_iwad_len);

    uint32_t wadsize;
    spiFlashGetData(&wadsize, sizeof(wadsize));

    if (wadsize)
    {
        spiFlashSetAddress((uint32_t) &header->infotableofs);

        int infotableofs;
        spiFlashGetData(&infotableofs, sizeof(infotableofs));

        filelump_t fileinfo;
        int_64_t nameint = 0;
        strncpy((char*) &nameint, name, 8);
#if 0
        // next-hack: why is the "for" reversed? Oh, now I read the
        // old doom code: to give priority to patches. However, reading
        // in reverse order will kill speed drastically (some menu were drawn
        // with single digit, generating also audio issues. Now we got 20fps.
        for(int i = _g->numlumps - 1; i >= 0; i--)
        {
            //This is a bit naughty with alignment.
            //For x86 doesn't matter because unaligned loads
            //are fine.
            //On ARM, unaligned loads are not fine but since it
            //doesn't have a 64bit load, the compiler will generate
            //32 bit loads. These vars are 32 aligned.
            spiFlashSetAddress(infotableofs + WAD_ADDRESS + i * sizeof(filelump_t));
            spiFlashGetData(&fileinfo, sizeof (filelump_t));
            int_64_t nameint2 = *(int_64_t*)fileinfo.name;

            if(nameint == nameint2)
            {
                *lump = (filelump_t*) (infotableofs + WAD_ADDRESS) + i;
                return i;
            }
        }
#else
        spiFlashSetAddress(infotableofs + WAD_ADDRESS);
        for (int i = 0; i < _g->numlumps; i++)
        {
            //This is a bit naughty with alignment.
            //For x86 doesn't matter because unaligned loads
            //are fine.
            //On ARM, unaligned loads are not fine but since it
            //doesn't have a 64bit load, the compiler will generate
            //32 bit loads. These vars are 32 aligned.
            spiFlashGetData(&fileinfo, sizeof(filelump_t));
            int_64_t nameint2 = *(int_64_t*) fileinfo.name;

            if (nameint == nameint2)
            {
                *lump = (filelump_t*) (infotableofs + WAD_ADDRESS) + i;
                return i;
            }
        }
#endif
    }
    else
    {
        printf("Zero Wad Size!\r\n");
    }
    *lump = NULL;
    return -1;
}

static const filelump_t* PUREFUNC FindLumpByNum(int num)
{
    wadinfo_t header;
    if (num < 0)
        return NULL;
    spiFlashSetAddress((uint32_t) p_doom_iwad_len);
    uint32_t wadLength;
    spiFlashGetData(&wadLength, sizeof(uint32_t));
    if (wadLength)
    {
        spiFlashSetAddress((uint32_t) doom_iwad);
        spiFlashGetData(&header, sizeof(header));

        if (num >= header.numlumps)
        {
            return NULL;
        }
        return (filelump_t*) (WAD_ADDRESS + header.infotableofs + num * sizeof(filelump_t));
    }
    return NULL;
}

//
// W_CheckNumForName
// Returns -1 if name not found.
//
// Rewritten by Lee Killough to use hash table for performance. Significantly
// cuts down on time -- increases Doom performance over 300%. This is the
// single most important optimization of the original Doom sources, because
// lump name lookup is used so often, and the original Doom used a sequential
// search. For large wads with > 1000 lumps this meant an average of over
// 500 were probed during every search. Now the average is under 2 probes per
// search. There is no significant benefit to packing the names into longwords
// with this new hashing algorithm, because the work to do the packing is
// just as much work as simply doing the string comparisons with the new
// algorithm, which minimizes the expected number of comparisons to under 2.
//
// killough 4/17/98: add namespace parameter to prevent collisions
// between different resources such as flats, sprites, colormaps
//

int PUREFUNC W_CheckNumForName(const char *name)
{
    const filelump_t *lump = NULL;

    return FindLumpByName(name, &lump);
}

// W_GetNumForName
// Calls W_CheckNumForName, but bombs out if not found.
//
int PUREFUNC W_GetNumForName(const char *name)     // killough -- const added
{
    int i = W_CheckNumForName(name);

    if (i == -1)
        I_Error("W_GetNumForName: %.8s not found", name);

    return i;
}

const char* PUREFUNC W_GetNameForNum(int lump)
{
    const filelump_t *l = FindLumpByNum(lump);
    if (l)
    {
        return l->name;
    }

    return NULL;
}

// W_Init
// Loads each of the files in the wadfiles array.
// All files are optional, but at least one file
//  must be found.
// Files with a .wad extension are idlink files
//  with multiple lumps.
// Other files are single lumps with the base filename
//  for the lump name.
// Lump names can appear multiple times.
// The name searcher looks backwards, so a later file
//  does override all earlier ones.
//
// CPhipps - modified to use the new wadfiles array
//

void W_Init(void)
{
    // CPhipps - start with nothing

    _g->numlumps = 0;

    W_AddFile();

    if (!_g->numlumps)
        I_Error("W_Init: No files found");
}

//
// W_LumpLength
// Returns the buffer size needed to load the given lump.
//

int PUREFUNC W_LumpLength(int lump)
{
    const filelump_t *l = FindLumpByNum(lump);

    if (l)
    {
        spiFlashSetAddress((uint32_t) &l->size);
        int size;
        spiFlashGetData(&size, sizeof(size));
        return size;
    }

    I_Error("W_LumpLength: %i >= numlumps", lump);

    return 0;
}

static const void* PUREFUNC W_GetLumpPtr(int lump)
{
    const filelump_t *l = FindLumpByNum(lump);

    if (l)
    {
        spiFlashSetAddress((uint32_t) &l->filepos);
        int filepos;
        spiFlashGetData(&filepos, sizeof(filepos));
        return (const uint8_t*) WAD_ADDRESS + filepos;
    }
    return NULL;
}
void* getAddressOrCacheLumpNum(int lump, boolean storeInFlash, uint8_t flashRegion)
{
//  printf("Get addr: %d 0x%08x 0x%08x Lump Array in Flash %s\r\n", lump, lumpPtrArray[lump], lumpPtrArray, lumpPtrArrayStoredInFlash ? "yes" : "no");
    if (lump > _g->numlumps)
    {
        printf("Attempt to load a non existent lump. %d Blocking\r\n", lump);
        while (1);
    }
    if (lumpPtrArray == NULL && !storeInFlash)
    {
        return (void*) W_GetLumpPtr(lump);
    }
    //
    if (lumpPtrArray[lump] != (void*) 0xFFFFFFFF && lumpPtrArray[lump])
        return lumpPtrArray[lump];

    void *address;
    if (storeInFlash)
    {
        printf("Storing in flash\r\n");
        address = writeLumpToFlashRegion(lump, flashRegion, true);
    }
    else
    {
        address = (void*) W_GetLumpPtr(lump);
        updateLumpAddresses(lump, address);
    }
    return address;

}

const void* /*PUREFUNC*/W_CacheLumpNum(int lump)
{

    //return   W_GetLumpPtr(lump);
    // printf("Caching lump %d ... ", lump);
    void *addr = getAddressOrCacheLumpNum(lump, false, 0);
    // printf("cached to --> 0x%08x\r\n",  addr);
    return addr;
}
